IDEA StatiCa Open Model
OpenModel.AddObject Method (OpenAttribute)
Compatible with IDEA StatiCa Beta 21.0 - beta
 Add new atribute object into collections
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public int AddObject(
	OpenAttribute obj
)
Public Function AddObject (
	obj As OpenAttribute
) As Integer
public:
int AddObject(
	OpenAttribute^ obj
)
Parameters
obj
Type: IdeaRS.OpenModel.OpenAttribute
Added object
Return Value
Type: Int32
Return value 0 - OK, -1 - false
Remarks
See Also
Reference
OpenModel Class
AddObject Overload
IdeaRS.OpenModel Namespace